<?php
// Copyright 2026 The terCAD team. All rights reserved.
// Use of this source code is governed by a CC BY-NC-ND 4.0 license that can be found in the LICENSE file.

namespace App\Settings;

class Defines
{
    public const URL = 'https://www.fantasyland.ru/';
    public const CITADEL = 'https://www.citadel-liga.info/liga/';
    public const PLUGIN_VERSION = '3.0.43';

    public const LAB = [
        19 => [
            2 => ['title' => 'Башня Смерти', 'id' => 9, 'x' => 30, 'y' => 30, 'z' => 1],
        ],
        9 => [
            12 => ['title' => 'Башня Хаоса', 'id' => 5, 'x' => 30, 'y' => 30, 'z' => 13],
            19 => ['title' => 'Древний Лаз', 'id' => 106, 'x' => 40, 'y' => 40, 'z' => 3],
            23 => ['title' => 'Лабиринт Ужаса', 'id' => 123, 'x' => 30, 'y' => 30, 'z' => 4],
            20 => ['title' => 'Обитель Теней', 'id' => 107, 'x' => 20, 'y' => 20, 'z' => 1],
        ],
        20 => [
            7 => ['title' => 'Болота в Болотном Замке', 'id' => 16, 'x' => 100, 'y' => 100, 'z' => 1],
        ],
        11 => [
            10 => ['title' => 'Болото (Ведьмины Топи)', 'id' => 13, 'x' => 100, 'y' => 100, 'z' => 1],
            15 => ['title' => 'Дальнее Болото', 'id' => 31, 'x' => 125, 'y' => 125, 'z' => 1],
            16 => ['title' => 'Делянка Канопликуса', 'id' => 32, 'x' => 30, 'y' => 30, 'z' => 1],
            19 => ['title' => 'Долина Ведунов: Ближний Лог', 'id' => 35, 'x' => 30, 'y' => 30, 'z' => 1],
            20 => ['title' => 'Долина Ведунов: Дол Плакучих Ив', 'id' => 36, 'x' => 30, 'y' => 30, 'z' => 1],
            21 => ['title' => 'Долина Ведунов: Приалтарье', 'id' => 37, 'x' => 30, 'y' => 30, 'z' => 1],
            17 => ['title' => 'Домик Канопликуса', 'id' => 33, 'x' => 5, 'y' => 5, 'z' => 1],
            23 => ['title' => 'Омут Грынпыса', 'id' => 39, 'x' => 1, 'y' => 1, 'z' => 1],
            24 => ['title' => 'Приозерье', 'id' => 40, 'x' => 50, 'y' => 50, 'z' => 1],
            25 => ['title' => 'Протоки Дардрии', 'id' => 41, 'x' => 50, 'y' => 50, 'z' => 1],
            29 => ['title' => 'Схрон Афлиганцев', 'id' => 45, 'x' => 25, 'y' => 25, 'z' => 1],
            26 => ['title' => 'Цветочная Скатерть', 'id' => 42, 'x' => 40, 'y' => 40, 'z' => 1],
            22 => ['title' => 'Урочище Выползней', 'id' => 38, 'x' => 50, 'y' => 50, 'z' => 1],
            18 => ['title' => 'Шабаш Ведьмиг', 'id' => 34, 'x' => 20, 'y' => 20, 'z' => 1],
        ],
        53 => [
            19 => ['title' => 'Волчий Кряж', 'id' => 189, 'x' => 40, 'y' => 40, 'z' => 3],
            22 => ['title' => 'Высокогорное Плато', 'id' => 192, 'x' => 40, 'y' => 40, 'z' => 3],
            25 => ['title' => 'Лазуритовый Утёс', 'id' => 195, 'x' => 40, 'y' => 40, 'z' => 3],
            29 => ['title' => 'Подземелье Лунного Аббатства', 'id' => 199, 'x' => 40, 'y' => 40, 'z' => 4],
            30 => ['title' => 'Псарни', 'id' => 200, 'x' => 15, 'y' => 15, 'z' => 1],
            23 => ['title' => 'Руины Замка', 'id' => 201, 'x' => 40, 'y' => 40, 'z' => 1],
        ],
        45 => [
            3 => ['title' => 'Глубины Небытия', 'id' => 184, 'x' => 30, 'y' => 30, 'z' => 1],
            1 => ['title' => 'Небытие', 'id' => 175, 'x' => 40, 'y' => 40, 'z' => 4],
        ],
        39 => [
            2 => ['title' => 'Древнее Ущелье', 'id' => 126, 'x' => 30, 'y' => 30, 'z' => 8],
        ],
        13 => [
            11 => ['title' => 'Долина Магов', 'id' => 4, 'x' => 30, 'y' => 30, 'z' => 13],
            26 => ['title' => 'Магическая Шахта', 'id' => 124, 'x' => 30, 'y' => 30, 'z' => 4],
        ],
        33 => [
            3 => ['title' => 'Заброшенная Ферма', 'id' => 119, 'x' => 30, 'y' => 30, 'z' => 7],
        ],
        7 => [
            30 => ['title' => 'Залесье', 'id' => 177, 'x' => 40, 'y' => 40, 'z' => 3],
            3 => ['title' => 'Лагденойский Лес', 'id' => 12, 'x' => 100, 'y' => 100, 'z' => 1],
        ],
        4 => [
            13 => ['title' => 'Замок Паладинов', 'id' => 1, 'x' => 30, 'y' => 30, 'z' => 13],
            25 => ['title' => 'Обитель Святых', 'id' => 122, 'x' => 30, 'y' => 30, 'z' => 4],
        ],
        26 => [
            11 => ['title' => 'Заовражье', 'id' => 111, 'x' => 45, 'y' => 45, 'z' => 1],
            12 => ['title' => 'Зеленая Колыбель', 'id' => 112, 'x' => 30, 'y' => 30, 'z' => 1],
            9 => ['title' => 'Лес Лотариель', 'id' => 109, 'x' => 60, 'y' => 60, 'z' => 1],
            10 => ['title' => 'Черная Пещера Шаманов', 'id' => 110, 'x' => 25, 'y' => 15, 'z' => 1],
        ],
        5 => [
            6 => ['title' => 'Казематы', 'id' => 43, 'x' => 30, 'y' => 30, 'z' => 5],
        ],
        6 => [
            27 => ['title' => 'Канализация Илдиора', 'id' => 19, 'x' => 40, 'y' => 40, 'z' => 3],
            25 => ['title' => 'Лес в Илдиоре', 'id' => 11, 'x' => 100, 'y' => 100, 'z' => 1],
        ],
        2 => [
            62 => ['title' => 'Канализация Столицы', 'id' => 3, 'x' => 40, 'y' => 40, 'z' => 3],
            71 => ['title' => 'Лес в Столице', 'id' => 10, 'x' => 100, 'y' => 100, 'z' => 1],
        ],
        43 => [
            11 => ['title' => 'Ледяное Ущелье', 'id' => 162, 'x' => 30, 'y' => 30, 'z' => 8],
            10 => ['title' => 'Мрачный Лес', 'id' => 161, 'x' => 100, 'y' => 100, 'z' => 1],
        ],
        14 => [
            8 => ['title' => 'Лес в Лесном Замке', 'id' => 15, 'x' => 100, 'y' => 100, 'z' => 1],
        ],
        16 => [
            11 => ['title' => 'Пещеры в Горном Замке', 'id' => 17, 'x' => 100, 'y' => 100, 'z' => 1],
        ],
        18 => [
            5 => ['title' => 'Пещеры Драконов', 'id' => 8, 'x' => 30, 'y' => 30, 'z' => 13],
            11 => ['title' => 'Ходы Полозов', 'id' => 125, 'x' => 30, 'y' => 30, 'z' => 4],
        ],
        15 => [
            13 => ['title' => 'Подвалы Призрачной Башни', 'id' => 7, 'x' => 30, 'y' => 30, 'z' => 3],
        ],
        12 => [
            19 => ['title' => 'Пустыня в Порту', 'id' => 108, 'x' => 100, 'y' => 100, 'z' => 1],
        ],
    ];
}
